pureDEM/test2/openHFDIB-STL/inclineAngle-10deg/polyhedron_80-sided/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     HFDIBDEMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime        0.76;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval     1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

maxCo           1;

maxDeltaT       1e-3;

adjustTimeStep  no;

runTimeModifiable yes;

// ************************************************************************* //
